{
  "name": "Piped",
  "longDescription": "<p>Piped is an open-source alternative frontend for YouTube with a strong emphasis on safeguarding user privacy and data security. This privacy-focused platform was born as a response to the increasingly invasive privacy policies and data collection practices employed by mainstream video-sharing platforms like YouTube.</p><p>With Piped, users can enjoy content without the fear of their every click and preference being monitored. Piped offers a host of user-centric features, including an ad-free experience, no tracking, a lightweight design that places minimal load on both servers and clients, infinite scrolling for seamless content discovery, and the flexibility to switch between light and dark themes. It also provides login functionality, customizable feeds, integration with SponsorBlock and LBRY for streaming, 4K video support, and bypassing geo-restrictions where possible through a federated network.</p><p>From a technical perspective, Piped incorporates multi-region load-balancing and is designed to handle thousands of users concurrently. Notably, it achieves these features without relying on official YouTube APIs, instead using NewPipeExtractor to extract information and offering a public JSON API. Furthermore, Piped operates on a federated protocol on Matrix, enabling instances to collaborate with each other.</p><p>The platform is actively developed, translated into multiple languages, and is hosted on various mirror sites for redundancy and availability. Self-hosting is also supported, allowing users to have full control over their experience. Piped is released under the AGPL v3 license and is actively maintained by a dedicated community of contributors.</p>",  
  "description": "Piped is a privacy-focused open-source YouTube frontend that offers users an alternative to the official YouTube platform. It prioritizes user privacy and offers a range of features to enhance the viewing experience.",
  "tags": ["YouTube frontend", "privacy-focused", "open-source", "AGPL v3", "Matrix", "IPFS", "continuous development"],
  "repository": "https://github.com/TeamPiped/Piped",
  "image": "https://hub.docker.com/r/1337kavin/piped",
  "supported_architectures": ["amd64", "arm64"]
}
